In [12]:
from dotenv import load_dotenv
import datetime
import sys
import pandas as pd
from BlsGov import BlsGov

In [5]:
today = datetime.date.today()
year = today.year

bls = BlsGov()
data = bls.get_data('CUSR0000SA0', str(today.year-19), str(today.year))

[]

In [13]:
df = pd.DataFrame(data['Results']['series'][0]['data'])

In [14]:
df

     year period periodName latest    value footnotes
0    2023    M09  September   true  307.481      [{}]
1    2023    M08     August    NaN  306.269      [{}]
2    2023    M07       July    NaN  304.348      [{}]
3    2023    M06       June    NaN  303.841      [{}]
4    2023    M05        May    NaN  303.294      [{}]
..    ...    ...        ...    ...      ...       ...
232  2004    M05        May    NaN    188.2      [{}]
233  2004    M04      April    NaN    187.4      [{}]
234  2004    M03      March    NaN    187.1      [{}]
235  2004    M02   February    NaN    186.7      [{}]
236  2004    M01    January    NaN    186.3      [{}]

[237 rows x 6 columns]

In [15]:
bls.get_data_as_pandas_df('CUSR0000SA0', str(today.year-19), str(today.year))

     year period periodName latest    value footnotes
0    2023    M09  September   true  307.481      [{}]
1    2023    M08     August    NaN  306.269      [{}]
2    2023    M07       July    NaN  304.348      [{}]
3    2023    M06       June    NaN  303.841      [{}]
4    2023    M05        May    NaN  303.294      [{}]
..    ...    ...        ...    ...      ...       ...
232  2004    M05        May    NaN    188.2      [{}]
233  2004    M04      April    NaN    187.4      [{}]
234  2004    M03      March    NaN    187.1      [{}]
235  2004    M02   February    NaN    186.7      [{}]
236  2004    M01    January    NaN    186.3      [{}]

[237 rows x 6 columns]